In [2]:
# imports
import pandas as pd

# read csv file and print
titanic_data = pd.read_csv("https://raw.githubusercontent.com/dphi-official/First_ML_Model/master/titanic.csv", index_col = 'PassengerId')
titanic_data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
# Fare feature has 0 missing values => TRUE

# check missing values
titanic_data.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [8]:
# Male passengers are more than female passangers in count => True

# check count of specified cols
titanic_data['Sex'].tolist().count('female') < titanic_data['Sex'].tolist().count('male')

577

In [10]:
# Most of the passengers have _______ siblings/spouses. => 0

# check mode of SibSp
titanic_data['SibSp'].mode()

0    0
dtype: int64

In [18]:
# What is the proportion of passengers who survived? => 0.38

# get proportion of specified column and round it
round(titanic_data['Survived'].value_counts() / len( titanic_data['Survived']), 2)

0    0.62
1    0.38
Name: Survived, dtype: float64

In [19]:
# What is the median Fare of the passengers? => 14.4542

# get median of specified column
titanic_data['Fare'].median()

14.4542

In [39]:
# Percentage of women survived was more than percentage of men survived => True

# Compare survived sexes
titanic_data[ titanic_data['Sex'] == 'female']['Survived'].tolist().count(1) > titanic_data[ titanic_data['Sex'] == 'male']['Survived'].tolist().count(1)

True

In [46]:
# It looks like first class passengers were given priority to survive => True

for i in range(1,4):
  print(i, "class survival ratio:", titanic_data[ titanic_data['Survived'] == 1]['Pclass'].tolist().count(i) / len( titanic_data[ titanic_data['Pclass'] == i]))

1 class survival ratio: 0.6296296296296297
2 class survival ratio: 0.47282608695652173
3 class survival ratio: 0.24236252545824846

In [76]:
# It looks like Children were given priority to survive => True
for i in range(1, 19):
  print( titanic_data[ titanic_data['Survived'] == 1]['Age'].tolist().count(i) / titanic_data['Age'].tolist().count(i) )

0.7142857142857143
0.3
0.8333333333333334
0.7
1.0
0.6666666666666666
0.3333333333333333
0.5
0.25
0.0
0.25
1.0
1.0
0.5
0.8
0.35294117647058826
0.46153846153846156
0.34615384615384615

In [51]:
# Create a subset of the data, only taking observations for which the passenger survived. 
# Call this newly created dataset as survived_passengers.
survived_passengers = titanic_data[ titanic_data['Survived'] == 1]

# How many of the survived passengers had embarked from 'Southampton' i.e. 'S'? => 217
survived_passengers['Embarked'].tolist().count('S')

217

In [52]:
# Which of the following feature plays an important role in the survival of the passengers? => Age

# Check correlation of columns with the survived ones
survived_passengers.corr()

          Survived    Pclass       Age     SibSp     Parch      Fare
Survived       NaN       NaN       NaN       NaN       NaN       NaN
Pclass         NaN  1.000000 -0.418073 -0.033300  0.021584 -0.538125
Age            NaN -0.418073  1.000000 -0.143309 -0.315599  0.162648
SibSp          NaN -0.033300 -0.143309  1.000000  0.282498  0.122886
Parch          NaN  0.021584 -0.315599  0.282498  1.000000  0.116519
Fare           NaN -0.538125  0.162648  0.122886  0.116519  1.000000

In [56]:
'''
Five highest fares of the passengers:
PassengerId
259    512.3292
738    512.3292
680    512.3292
89     263.0000
28     263.0000
'''

# Sort Fare's descending order and get top 5
titanic_data['Fare'].sort_values( ascending=False).head()

PassengerId
259    512.3292
738    512.3292
680    512.3292
89     263.0000
28     263.0000
Name: Fare, dtype: float64

In [57]:
# Median age of the passenger is: => 28.0

# get median
titanic_data['Age'].median()

28.0

In [60]:
# There are 891 unique values in the Name column => True

# get len of the normalized(unique) values of specified column
len(titanic_data['Name'].value_counts(normalize=True))

891